# Setup

This is following [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html) for pandas 1.4.3

In [1]:
import numpy as np
import pandas as pd

# Object creation

In [2]:
# Series - pass a list to pd.Series
s1 = pd.Series([1, 2, 3, np.nan, 5])

In [3]:
s1

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
dtype: float64

In [4]:
# create an index to use in the dataframe
# default frequency is D (day), so creates a DatetimeIndex of 10 days
dates = pd.date_range('20220619', periods=10)
dates

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

just in case you are wondering, here's [all the "offset aliases"](https://pandas.pydata.org/docs/user_guide/timeseries.html#timeseries-offset-aliases) for Datetime

In [5]:
# Dataframe - pass a Numpy array
# create a 10 row, 4 col random number array, index by dates, give some column names
df = pd.DataFrame(np.random.randn(10, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717
2022-06-24 -1.079007 -0.706565  0.054317  1.127500
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482
2022-06-26 -2.036067  0.780300 -0.787670  0.833007
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380

In [6]:
# Create a dataframe by passing a dictionary of objects
# where each object can be converted into a series-like structure
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20220619"),
        "C": pd.Series(1, index=list(range(6)), dtype="float32"),
        "D": np.array([3]*6, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train", "test", "train"]),
        "F": list("foofoo"),
        "G": "foo"
    }
)

df2

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

In [7]:
# the datatype of each of the columns would be different
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
G            object
dtype: object

# Viewing Data

In [8]:
# top of the dataframe
df.head()

                   A         B         C         D
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717

In [9]:
# bottom 3 records of the dataframe
df.tail(3)

                   A         B         C         D
2022-06-26 -2.036067  0.780300 -0.787670  0.833007
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380

In [10]:
# index of the df
df.index

DatetimeIndex(['2022-06-19', '2022-06-20', '2022-06-21', '2022-06-22',
               '2022-06-23', '2022-06-24', '2022-06-25', '2022-06-26',
               '2022-06-27', '2022-06-28'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# columns of the df
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# .to_numpy gives a NumPy representation of the dataframe
# this is expensive if all columns are of different data type
df.to_numpy()

array([[-0.34001715,  1.1883935 , -0.41850639, -0.05372558],
       [ 2.02814136,  0.09182103,  1.36154644,  0.02251622],
       [-0.98373427, -1.7418193 , -0.38758335, -0.2024625 ],
       [-0.09844499, -1.23913987, -1.88684137, -0.72459386],
       [-1.472174  , -0.41045148,  0.27113557, -1.57671718],
       [-1.07900716, -0.70656473,  0.05431656,  1.12749974],
       [-0.86535546, -0.05170248, -1.08030138,  0.57748156],
       [-2.03606664,  0.78030003, -0.78767013,  0.83300681],
       [ 0.67141084, -0.63168309, -0.76334462, -0.25203894],
       [-1.69192059, -0.5591415 , -0.37828218, -0.09638018]])

In [13]:
df2.to_numpy()

array([[1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'f',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'test', 'o',
        'foo'],
       [1.0, Timestamp('2022-06-19 00:00:00'), 1.0, 3, 'train', 'o',
        'foo']], dtype=object)

In [14]:
# quick summary stats
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.586717  -0.327999  -0.401553  -0.034541
std     1.215793   0.875924   0.863882   0.775670
min    -2.036067  -1.741819  -1.886841  -1.576717
25%    -1.373882  -0.687844  -0.781589  -0.239645
50%    -0.924545  -0.484796  -0.403045  -0.075053
75%    -0.158838   0.055940  -0.053833   0.438740
max     2.028141   1.188393   1.361546   1.127500

1. **count** = Count number of non-NA/null observations
1. **max** = Maximum of the values in the object
1. **min** = Minimum of the values in the object
1. **mean** = Mean of the values
1. **std** = Standard deviation of the observations
1. **25%** = Default lower percentile
1. **50%** = 50 percentile - same as the median 
1. **75%** = Default upper percentile

In [15]:
# change the percentiles
df.describe(percentiles=[.1, .5, .9])

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean   -0.586717  -0.327999  -0.401553  -0.034541
std     1.215793   0.875924   0.863882   0.775670
min    -2.036067  -1.741819  -1.886841  -1.576717
10%    -1.726335  -1.289408  -1.160955  -0.809806
50%    -0.924545  -0.484796  -0.403045  -0.075053
90%     0.807084   0.821109   0.380177   0.862456
max     2.028141   1.188393   1.361546   1.127500

In [16]:
# E, F, G in d2 are not numeric, so do not come up in describe()
df2.describe()

         A    C    D
count  6.0  6.0  6.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [17]:
# transpose the data
# turn rows to columns and vice versa
df.T

,2022-06-19,2022-06-20,2022-06-21,2022-06-22,2022-06-23,2022-06-24,2022-06-25,2022-06-26,2022-06-27,2022-06-28
A,-0.340017,2.028141,-0.983734,-0.098445,-1.472174,-1.079007,-0.865355,-2.036067,0.671411,-1.691921
B,1.188393,0.091821,-1.741819,-1.239140,-0.410451,-0.706565,-0.051702,0.780300,-0.631683,-0.559141
C,-0.418506,1.361546,-0.387583,-1.886841,0.271136,0.054317,-1.080301,-0.787670,-0.763345,-0.378282
D,-0.053726,0.022516,-0.202463,-0.724594,-1.576717,1.127500,0.577482,0.833007,-0.252039,-0.096380

### [Axis in pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.set_axis.html?highlight=set_ax#pandas.DataFrame.set_axis)

```axis{0 or ‘index’, 1 or ‘columns’}```

Always remember that when you specify:
* ```axis=0``` or ```axis='index'``` you indicate that the operation should be along the _index_ (aka across the rows). More often than not indexes will go from top to bottom (vertically), but sometimes they may not (for e.g. if you use columns as index or when you have hierarchical or multi-index data).
* ```axis=1``` or ```axis='columns'``` indicates the operation is along the columns

When in doubt use the explicit version ```'index'``` or ```'columns'``` instead of ```0``` or ```1```

In [18]:
# sort along the axis - 1 = horizontal
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2022-06-19 -0.053726 -0.418506  1.188393 -0.340017
2022-06-20  0.022516  1.361546  0.091821  2.028141
2022-06-21 -0.202463 -0.387583 -1.741819 -0.983734
2022-06-22 -0.724594 -1.886841 -1.239140 -0.098445
2022-06-23 -1.576717  0.271136 -0.410451 -1.472174
2022-06-24  1.127500  0.054317 -0.706565 -1.079007
2022-06-25  0.577482 -1.080301 -0.051702 -0.865355
2022-06-26  0.833007 -0.787670  0.780300 -2.036067
2022-06-27 -0.252039 -0.763345 -0.631683  0.671411
2022-06-28 -0.096380 -0.378282 -0.559141 -1.691921

In [19]:
# sort along the axis - 0 = vertical
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039
2022-06-26 -2.036067  0.780300 -0.787670  0.833007
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482
2022-06-24 -1.079007 -0.706565  0.054317  1.127500
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726

In [20]:
# sort ascending by values in a column
df.sort_values(by="A")

                   A         B         C         D
2022-06-26 -2.036067  0.780300 -0.787670  0.833007
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717
2022-06-24 -1.079007 -0.706565  0.054317  1.127500
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039
2022-06-20  2.028141  0.091821  1.361546  0.022516

In [21]:
# sort by non-numerical values
df2.sort_values(by="F", ascending=False)

     A          B    C  D      E  F    G
1  1.0 2022-06-19  1.0  3  train  o  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo

In [22]:
# sort by two or more columns
df2.sort_values(by=["F", "E"])

     A          B    C  D      E  F    G
0  1.0 2022-06-19  1.0  3   test  f  foo
3  1.0 2022-06-19  1.0  3  train  f  foo
2  1.0 2022-06-19  1.0  3   test  o  foo
4  1.0 2022-06-19  1.0  3   test  o  foo
1  1.0 2022-06-19  1.0  3  train  o  foo
5  1.0 2022-06-19  1.0  3  train  o  foo

# Selection

For production prefer the following instead of other data access methods (typical python methods like ["col"] or [a:b] slices etc.):

```.at, .iat, .loc and .iloc.```

## Getting

In [23]:
# selecting a single column returns a Series object
df["A"]

2022-06-19   -0.340017
2022-06-20    2.028141
2022-06-21   -0.983734
2022-06-22   -0.098445
2022-06-23   -1.472174
2022-06-24   -1.079007
2022-06-25   -0.865355
2022-06-26   -2.036067
2022-06-27    0.671411
2022-06-28   -1.691921
Freq: D, Name: A, dtype: float64

In [24]:
# selecting a slice
df[1:5]

                   A         B         C         D
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717

## Selection by label

In [25]:
# selecting based on a label
df.loc[dates[0]]

A   -0.340017
B    1.188393
C   -0.418506
D   -0.053726
Name: 2022-06-19 00:00:00, dtype: float64

In [26]:
# select on a multi-axis by lable
# I honestly do not know what the comment above means...help!
df.loc[:, ["A", "B"]]

                   A         B
2022-06-19 -0.340017  1.188393
2022-06-20  2.028141  0.091821
2022-06-21 -0.983734 -1.741819
2022-06-22 -0.098445 -1.239140
2022-06-23 -1.472174 -0.410451
2022-06-24 -1.079007 -0.706565
2022-06-25 -0.865355 -0.051702
2022-06-26 -2.036067  0.780300
2022-06-27  0.671411 -0.631683
2022-06-28 -1.691921 -0.559141

In [27]:
# specific index value results in reduction of dimensions
res = df.loc["2022-06-20"]
print(res)
print("res.shape = ", res.shape, " vs. df.shape = ", df.shape)

A    2.028141
B    0.091821
C    1.361546
D    0.022516
Name: 2022-06-20 00:00:00, dtype: float64
res.shape =  (4,)  vs. df.shape =  (10, 4)

In [28]:
# get to a specific scalar:
#
# method one
df.loc[dates[0], "A"]

-0.34001714851418596

In [29]:
#
# method two (slightly faster than method one)
df.at[dates[0], "A"]

-0.34001714851418596

## Selection by position

In [30]:
df.iloc[2]

A   -0.983734
B   -1.741819
C   -0.387583
D   -0.202463
Name: 2022-06-21 00:00:00, dtype: float64

In [31]:
# slices - similar to NumPy / Python - [row:slice, col:slice]
df.iloc[1:5, 0:2]

                   A         B
2022-06-20  2.028141  0.091821
2022-06-21 -0.983734 -1.741819
2022-06-22 -0.098445 -1.239140
2022-06-23 -1.472174 -0.410451

In [32]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
df.iloc[[0, 1, 2, 6], [0, 2]]

                   A         C
2022-06-19 -0.340017 -0.418506
2022-06-20  2.028141  1.361546
2022-06-21 -0.983734 -0.387583
2022-06-25 -0.865355 -1.080301

In [33]:
# by list of locations - similar to NumPy / Python - [[list of rows], [list of cols]]
# change the order of columns, repeact a column
df.iloc[[0, 1, 2, 6], [2, 1, 0, 2]]

                   C         B         A         C
2022-06-19 -0.418506  1.188393 -0.340017 -0.418506
2022-06-20  1.361546  0.091821  2.028141  1.361546
2022-06-21 -0.387583 -1.741819 -0.983734 -0.387583
2022-06-25 -1.080301 -0.051702 -0.865355 -1.080301

In [34]:
# slice rows explicitly, keep all columns
df.iloc[[1, 2], :]

                   A         B         C         D
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463

In [35]:
# slice columns, keep all rows
df.iloc[:, [2, 3]]

                   C         D
2022-06-19 -0.418506 -0.053726
2022-06-20  1.361546  0.022516
2022-06-21 -0.387583 -0.202463
2022-06-22 -1.886841 -0.724594
2022-06-23  0.271136 -1.576717
2022-06-24  0.054317  1.127500
2022-06-25 -1.080301  0.577482
2022-06-26 -0.787670  0.833007
2022-06-27 -0.763345 -0.252039
2022-06-28 -0.378282 -0.096380

In [36]:
# everything, because you can
df.iloc[:, :]

                   A         B         C         D
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717
2022-06-24 -1.079007 -0.706565  0.054317  1.127500
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482
2022-06-26 -2.036067  0.780300 -0.787670  0.833007
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380

In [37]:
# get to a scalar (2 methods, just like before)
#
# method one: use iloc
df.iloc[1, 2]

1.361546440276635

In [38]:
#
# method two: use iat
df.iat[1, 2]

1.361546440276635

## Boolean Indexing

In [39]:
# use a value found in a single col to get data
df[df["A"] > 0]

                   A         B         C         D
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039

In [40]:
# boolean across the entire DF - vals that don't match go NaN
df[df > 0]

                   A         B         C         D
2022-06-19       NaN  1.188393       NaN       NaN
2022-06-20  2.028141  0.091821  1.361546  0.022516
2022-06-21       NaN       NaN       NaN       NaN
2022-06-22       NaN       NaN       NaN       NaN
2022-06-23       NaN       NaN  0.271136       NaN
2022-06-24       NaN       NaN  0.054317  1.127500
2022-06-25       NaN       NaN       NaN  0.577482
2022-06-26       NaN  0.780300       NaN  0.833007
2022-06-27  0.671411       NaN       NaN       NaN
2022-06-28       NaN       NaN       NaN       NaN

In [41]:
# add another column
df11 = df.copy()
df11["E"] = ["one", "two", "three", "four",
             "two", "five", "one", "two", "three", "four"]
df11

                   A         B         C         D      E
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726    one
2022-06-20  2.028141  0.091821  1.361546  0.022516    two
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  three
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594   four
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717    two
2022-06-24 -1.079007 -0.706565  0.054317  1.127500   five
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482    one
2022-06-26 -2.036067  0.780300 -0.787670  0.833007    two
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039  three
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380   four

In [42]:
# the isin() query - basically the in clause
df11[df11["E"].isin(["two", "five"])]

                   A         B         C         D     E
2022-06-20  2.028141  0.091821  1.361546  0.022516   two
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717   two
2022-06-24 -1.079007 -0.706565  0.054317  1.127500  five
2022-06-26 -2.036067  0.780300 -0.787670  0.833007   two

## Setting values

In [43]:
# matching indexes auto-aligns values
s1 = pd.Series(range(11, 21), index=pd.date_range('20220619', periods=10))
s1

2022-06-19    11
2022-06-20    12
2022-06-21    13
2022-06-22    14
2022-06-23    15
2022-06-24    16
2022-06-25    17
2022-06-26    18
2022-06-27    19
2022-06-28    20
Freq: D, dtype: int64

In [44]:
df["F"] = s1
df

                   A         B         C         D   F
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11
2022-06-20  2.028141  0.091821  1.361546  0.022516  12
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717  15
2022-06-24 -1.079007 -0.706565  0.054317  1.127500  16
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482  17
2022-06-26 -2.036067  0.780300 -0.787670  0.833007  18
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039  19
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380  20

In [45]:
# setting values by label and position
# first let's make a quick copy
df12 = df.copy()
df12

                   A         B         C         D   F
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11
2022-06-20  2.028141  0.091821  1.361546  0.022516  12
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717  15
2022-06-24 -1.079007 -0.706565  0.054317  1.127500  16
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482  17
2022-06-26 -2.036067  0.780300 -0.787670  0.833007  18
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039  19
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380  20

In [46]:
# set by label
df12.at[dates[0], "A"] = 0
# set by position
df12.iat[0, 1] = 0
df12

                   A         B         C         D   F
2022-06-19  0.000000  0.000000 -0.418506 -0.053726  11
2022-06-20  2.028141  0.091821  1.361546  0.022516  12
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717  15
2022-06-24 -1.079007 -0.706565  0.054317  1.127500  16
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482  17
2022-06-26 -2.036067  0.780300 -0.787670  0.833007  18
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039  19
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380  20

In [47]:
# kinda bigger replacement
df12.loc[:, "D"] = np.array([5]*len(df))
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000 -0.418506  5  11
2022-06-20  2.028141  0.091821  1.361546  5  12
2022-06-21 -0.983734 -1.741819 -0.387583  5  13
2022-06-22 -0.098445 -1.239140 -1.886841  5  14
2022-06-23 -1.472174 -0.410451  0.271136  5  15
2022-06-24 -1.079007 -0.706565  0.054317  5  16
2022-06-25 -0.865355 -0.051702 -1.080301  5  17
2022-06-26 -2.036067  0.780300 -0.787670  5  18
2022-06-27  0.671411 -0.631683 -0.763345  5  19
2022-06-28 -1.691921 -0.559141 -0.378282  5  20

In [48]:
# setting values using a boolean selection (aka where clause)
df12[df12 > 0] = -df12
df12

                   A         B         C  D   F
2022-06-19  0.000000  0.000000 -0.418506 -5 -11
2022-06-20 -2.028141 -0.091821 -1.361546 -5 -12
2022-06-21 -0.983734 -1.741819 -0.387583 -5 -13
2022-06-22 -0.098445 -1.239140 -1.886841 -5 -14
2022-06-23 -1.472174 -0.410451 -0.271136 -5 -15
2022-06-24 -1.079007 -0.706565 -0.054317 -5 -16
2022-06-25 -0.865355 -0.051702 -1.080301 -5 -17
2022-06-26 -2.036067 -0.780300 -0.787670 -5 -18
2022-06-27 -0.671411 -0.631683 -0.763345 -5 -19
2022-06-28 -1.691921 -0.559141 -0.378282 -5 -20

# Missing Data

### _reindex_
change/add/delete index on a specified axis, returns a new dataframe

In [49]:
df13 = df.reindex(index=dates[0:4], columns=list(df.columns)+["G"])
df13

                   A         B         C         D   F   G
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11 NaN
2022-06-20  2.028141  0.091821  1.361546  0.022516  12 NaN
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13 NaN
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14 NaN

### handling missing data
1. _```np.nan```_
1. _```pandas.isna()```_
1. ```df.dropna()```
1. ```df.fillna()```

In [50]:
# missing data in pandas is np.nan
df13.iat[1, 0] = np.nan
df13.iloc[1:, 5] = np.random.randint(1)
df13

                   A         B         C         D   F    G
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11  NaN
2022-06-20       NaN  0.091821  1.361546  0.022516  12  0.0
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13  0.0
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14  0.0

In [51]:
# get a boolean mask where values are NaN
df131 = pd.isna(df13)
df131

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [52]:
# or just
pd.isna(df13)

                A      B      C      D      F      G
2022-06-19  False  False  False  False  False   True
2022-06-20   True  False  False  False  False  False
2022-06-21  False  False  False  False  False  False
2022-06-22  False  False  False  False  False  False

In [53]:
# the original is still there
df13

                   A         B         C         D   F    G
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11  NaN
2022-06-20       NaN  0.091821  1.361546  0.022516  12  0.0
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13  0.0
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14  0.0

In [54]:
# we are going to drop / replace values now, let's make a couple of copies of the dataframe
df132 = df13.copy()
df132

                   A         B         C         D   F    G
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11  NaN
2022-06-20       NaN  0.091821  1.361546  0.022516  12  0.0
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13  0.0
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14  0.0

In [55]:
# drop rows/columns that have missing data
# by default it returns a new dataframe, you may want to specify inplace=True for modifying current dataframe:
df_no_na = df132.dropna(how="any")
# how=‘any’ : If any NA values are present, drop that row or column.
# how=‘all’ : If all values are NA, drop that row or column.

In [56]:
# all rows/cols with missing data stripped
df_no_na

                   A         B         C         D   F    G
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13  0.0
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14  0.0

In [57]:
# original still intact
df132

                   A         B         C         D   F    G
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11  NaN
2022-06-20       NaN  0.091821  1.361546  0.022516  12  0.0
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13  0.0
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14  0.0

In [58]:
# drop missing data from original
df132.dropna(how="any", inplace=True)
df132

                   A         B         C         D   F    G
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13  0.0
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14  0.0

In [59]:
# fill missing data
df133 = df13.copy()
df133.fillna(np.pi*1000)

                      A         B         C         D   F            G
2022-06-19    -0.340017  1.188393 -0.418506 -0.053726  11  3141.592654
2022-06-20  3141.592654  0.091821  1.361546  0.022516  12     0.000000
2022-06-21    -0.983734 -1.741819 -0.387583 -0.202463  13     0.000000
2022-06-22    -0.098445 -1.239140 -1.886841 -0.724594  14     0.000000

# Align and Join

There needs to be a bigger notebook for this topic.
You need to know there's "joins" in Pandas just like in the SQL world, 
like join and left join and right join and inner and outer and all that...
Here we'll explore these in the context of the align function - 'aligning' the indexes of two dataframes.
Later we'll see these again in the context of _merging_ two data frames.

## Create two datasets with _mismatched_ indexes

In [60]:
# date range indexes
idx1 = pd.date_range('2022-01-01',periods = 10)
# 2022-01-01', '2022-01-02' don't exist in idx2
# '2022-01-11', '2022-01-12' don't exist in idx1
idx2 = pd.date_range('2022-01-03',periods = 10)

In [61]:
# dataframes from indexes
d1 = pd.DataFrame(index = idx1, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

d2 = pd.DataFrame(index = idx2, data = 
    {
        'A': np.random.rand(10),
        'B': np.random.randint(1, high=25, size = 10)
    }
)

## Quick Aside: Rendering two dataframes side-by-side

The trick of rendering 2 dataframes side-by-side was from [this](https://stackoverflow.com/questions/38783027/jupyter-notebook-display-two-pandas-tables-side-by-side) stackoverflow question.

In [62]:
# we gon need to display both data frames side by side, so...
from IPython.display import display_html 
def render_df_side_by_side(a, b, a_title = "", b_title = ""):
    a_styler = a.style.set_table_attributes("style='display:inline'").set_caption(a_title)
    b_styler = b.style.set_table_attributes("style='display:inline'").set_caption(b_title)
    display_html(a_styler._repr_html_()+b_styler._repr_html_(), raw=True)

In [63]:
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.026840,14
2022-01-02 00:00:00,0.211112,11
2022-01-03 00:00:00,0.523772,16
2022-01-04 00:00:00,0.075878,1
2022-01-05 00:00:00,0.981917,5
2022-01-06 00:00:00,0.075200,24
2022-01-07 00:00:00,0.480038,8
2022-01-08 00:00:00,0.691405,17
2022-01-09 00:00:00,0.245901,5
2022-01-10 00:00:00,0.336356,19
,A,B
2022-01-03 00:00:00,0.984314,21
2022-01-04 00:00:00,0.551986,10
2022-01-05 00:00:00,0.839656,23
2022-01-06 00:00:00,0.877686,16
2022-01-07 00:00:00,0.658135,12
2022-01-08 00:00:00,0.549557,6
2022-01-09 00:00:00,0.889792,14
2022-01-10 00:00:00,0.753322,12
2022-01-11 00:00:00,0.755780,16
2022-01-12 00:00:00,0.977525,14

Table rendering/styling options is [a bigger discussion](https://pandas.pydata.org/pandas-docs/stable/user_guide/style.html#) to be tackled later.

## .add, .sub, .mul, .div etc.

flexible wrappers (```add, sub, mul, div, mod, pow```) to arithmetic operators: ```+, -, *, /, //, %, **```

In [64]:
# the +, -, *, /, //, %, ** operations align indexes to create a UNION of indexes
d3 = d1+d2
d4 = d1.sub(d2) #equivalent to d1-d2
d5 = d1*d2
d6 = d1.div(d2)

In [65]:
# indexs not present in the other dataframe get a NaN
d3.style.highlight_null(null_color='red')

In [66]:
# sub
d4.style.highlight_null(null_color='red')

In [67]:
# mul
d5.style.highlight_null(null_color='red')

In [68]:
# div
d6.style.highlight_null(null_color='red')

### removing the NaN values from the resultant dataframe

In [69]:
# the + operation is UNION of indexes
d31 = d1+d2
# indexs not present in the other dataframe get a NaN
# do you can obvs remove nan values like before
d3.dropna().style.highlight_null(null_color='red')

## df.align()

Pandas [align](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.align.html) works to join the dataframes in interesting ways.

In [70]:
# align returns two dataframes - left and right as a result of a join
# default join is outer - the union of indices will be used as index for left and right
left, right = d1.align(d2, join='outer')
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.026840,14.000000
2022-01-02 00:00:00,0.211112,11.000000
2022-01-03 00:00:00,0.523772,16.000000
2022-01-04 00:00:00,0.075878,1.000000
2022-01-05 00:00:00,0.981917,5.000000
2022-01-06 00:00:00,0.075200,24.000000
2022-01-07 00:00:00,0.480038,8.000000
2022-01-08 00:00:00,0.691405,17.000000
2022-01-09 00:00:00,0.245901,5.000000
2022-01-10 00:00:00,0.336356,19.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.984314,21.000000
2022-01-04 00:00:00,0.551986,10.000000
2022-01-05 00:00:00,0.839656,23.000000
2022-01-06 00:00:00,0.877686,16.000000
2022-01-07 00:00:00,0.658135,12.000000
2022-01-08 00:00:00,0.549557,6.000000
2022-01-09 00:00:00,0.889792,14.000000
2022-01-10 00:00:00,0.753322,12.000000
2022-01-11 00:00:00,0.755780,16.000000
2022-01-12 00:00:00,0.977525,14.000000

In [71]:
# inner join
left, right = d1.align(d2, join='inner')
render_df_side_by_side(d1,d2)

,A,B
2022-01-01 00:00:00,0.026840,14
2022-01-02 00:00:00,0.211112,11
2022-01-03 00:00:00,0.523772,16
2022-01-04 00:00:00,0.075878,1
2022-01-05 00:00:00,0.981917,5
2022-01-06 00:00:00,0.075200,24
2022-01-07 00:00:00,0.480038,8
2022-01-08 00:00:00,0.691405,17
2022-01-09 00:00:00,0.245901,5
2022-01-10 00:00:00,0.336356,19
,A,B
2022-01-03 00:00:00,0.984314,21
2022-01-04 00:00:00,0.551986,10
2022-01-05 00:00:00,0.839656,23
2022-01-06 00:00:00,0.877686,16
2022-01-07 00:00:00,0.658135,12
2022-01-08 00:00:00,0.549557,6
2022-01-09 00:00:00,0.889792,14
2022-01-10 00:00:00,0.753322,12
2022-01-11 00:00:00,0.755780,16
2022-01-12 00:00:00,0.977525,14

In [72]:
# we can fill the NaNs with a certain value if needed
# let's fill with -100 so we can see it clearly
left, right = d1.align(d2, join='outer', fill_value = -100) 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.026840,14
2022-01-02 00:00:00,0.211112,11
2022-01-03 00:00:00,0.523772,16
2022-01-04 00:00:00,0.075878,1
2022-01-05 00:00:00,0.981917,5
2022-01-06 00:00:00,0.075200,24
2022-01-07 00:00:00,0.480038,8
2022-01-08 00:00:00,0.691405,17
2022-01-09 00:00:00,0.245901,5
2022-01-10 00:00:00,0.336356,19
2022-01-11 00:00:00,-100.000000,-100
2022-01-12 00:00:00,-100.000000,-100
,A,B
2022-01-01 00:00:00,-100.000000,-100
2022-01-02 00:00:00,-100.000000,-100
2022-01-03 00:00:00,0.984314,21
2022-01-04 00:00:00,0.551986,10
2022-01-05 00:00:00,0.839656,23
2022-01-06 00:00:00,0.877686,16
2022-01-07 00:00:00,0.658135,12
2022-01-08 00:00:00,0.549557,6
2022-01-09 00:00:00,0.889792,14
2022-01-10 00:00:00,0.753322,12
2022-01-11 00:00:00,0.755780,16
2022-01-12 00:00:00,0.977525,14

In [73]:
# left join: left index is added to right, but not the other way
left, right = d1.align(d2, join='left') 
render_df_side_by_side(left, right)

,A,B
2022-01-01 00:00:00,0.026840,14
2022-01-02 00:00:00,0.211112,11
2022-01-03 00:00:00,0.523772,16
2022-01-04 00:00:00,0.075878,1
2022-01-05 00:00:00,0.981917,5
2022-01-06 00:00:00,0.075200,24
2022-01-07 00:00:00,0.480038,8
2022-01-08 00:00:00,0.691405,17
2022-01-09 00:00:00,0.245901,5
2022-01-10 00:00:00,0.336356,19
,A,B
2022-01-01 00:00:00,nan,nan
2022-01-02 00:00:00,nan,nan
2022-01-03 00:00:00,0.984314,21.000000
2022-01-04 00:00:00,0.551986,10.000000
2022-01-05 00:00:00,0.839656,23.000000
2022-01-06 00:00:00,0.877686,16.000000
2022-01-07 00:00:00,0.658135,12.000000
2022-01-08 00:00:00,0.549557,6.000000
2022-01-09 00:00:00,0.889792,14.000000
2022-01-10 00:00:00,0.753322,12.000000

In [74]:
# right join: right index is added to left, but not the other way
left, right = d1.align(d2, join='right') 
render_df_side_by_side(left, right)

,A,B
2022-01-03 00:00:00,0.523772,16.000000
2022-01-04 00:00:00,0.075878,1.000000
2022-01-05 00:00:00,0.981917,5.000000
2022-01-06 00:00:00,0.075200,24.000000
2022-01-07 00:00:00,0.480038,8.000000
2022-01-08 00:00:00,0.691405,17.000000
2022-01-09 00:00:00,0.245901,5.000000
2022-01-10 00:00:00,0.336356,19.000000
2022-01-11 00:00:00,nan,nan
2022-01-12 00:00:00,nan,nan
,A,B
2022-01-03 00:00:00,0.984314,21
2022-01-04 00:00:00,0.551986,10
2022-01-05 00:00:00,0.839656,23
2022-01-06 00:00:00,0.877686,16
2022-01-07 00:00:00,0.658135,12
2022-01-08 00:00:00,0.549557,6
2022-01-09 00:00:00,0.889792,14
2022-01-10 00:00:00,0.753322,12
2022-01-11 00:00:00,0.755780,16
2022-01-12 00:00:00,0.977525,14

There's more to explore in align, and it can get confusing, so beginners be careful, take time and try to work out the result before you execute to build intuition.

# Operations on data

## Stats

Operations in general *exclude* missing data

In [75]:
# arithmetic mean, for each column (axis = 0)
df.mean()

A    -0.586717
B    -0.327999
C    -0.401553
D    -0.034541
F    15.500000
dtype: float64

In [76]:
# mean across a row (axis = 1)
df.mean(1)

2022-06-19    2.275229
2022-06-20    3.100805
2022-06-21    1.936880
2022-06-22    2.010196
2022-06-23    2.362359
2022-06-24    3.079249
2022-06-25    3.116024
2022-06-26    3.357914
2022-06-27    3.604869
2022-06-28    3.454855
Freq: D, dtype: float64

## Apply

In [77]:
# apply custom lambdas
df.apply(lambda x: x.max()-x.min())

A    4.064208
B    2.930213
C    3.248388
D    2.704217
F    9.000000
dtype: float64

In [78]:
df

                   A         B         C         D   F
2022-06-19 -0.340017  1.188393 -0.418506 -0.053726  11
2022-06-20  2.028141  0.091821  1.361546  0.022516  12
2022-06-21 -0.983734 -1.741819 -0.387583 -0.202463  13
2022-06-22 -0.098445 -1.239140 -1.886841 -0.724594  14
2022-06-23 -1.472174 -0.410451  0.271136 -1.576717  15
2022-06-24 -1.079007 -0.706565  0.054317  1.127500  16
2022-06-25 -0.865355 -0.051702 -1.080301  0.577482  17
2022-06-26 -2.036067  0.780300 -0.787670  0.833007  18
2022-06-27  0.671411 -0.631683 -0.763345 -0.252039  19
2022-06-28 -1.691921 -0.559141 -0.378282 -0.096380  20

In [79]:
# each subsequent value is a sum of all values before it in the respective column
cumsum_df = df.apply(np.cumsum)
render_df_side_by_side(df, cumsum_df, "OG Dataframe", "Cumulative Sum")

,A,B,C,D,F
2022-06-19 00:00:00,-0.340017,1.188393,-0.418506,-0.053726,11
2022-06-20 00:00:00,2.028141,0.091821,1.361546,0.022516,12
2022-06-21 00:00:00,-0.983734,-1.741819,-0.387583,-0.202463,13
2022-06-22 00:00:00,-0.098445,-1.239140,-1.886841,-0.724594,14
2022-06-23 00:00:00,-1.472174,-0.410451,0.271136,-1.576717,15
2022-06-24 00:00:00,-1.079007,-0.706565,0.054317,1.127500,16
2022-06-25 00:00:00,-0.865355,-0.051702,-1.080301,0.577482,17
2022-06-26 00:00:00,-2.036067,0.780300,-0.787670,0.833007,18
2022-06-27 00:00:00,0.671411,-0.631683,-0.763345,-0.252039,19
2022-06-28 00:00:00,-1.691921,-0.559141,-0.378282,-0.096380,20
,A,B,C,D,F
2022-06-19 00:00:00,-0.340017,1.188393,-0.418506,-0.053726,11
2022-06-20 00:00:00,1.688124,1.280215,0.943040,-0.031209,23
2022-06-21 00:00:00,0.704390,-0.461605,0.555457,-0.233672,36
2022-06-22 00:00:00,0.605945,-1.700745,-1.331385,-0.958266,50
2022-06-23 00:00:00,-0.866229,-2.111196,-1.060249,-2.534983,65
2022-06-24 00:00:00,-1.945236,-2.817761,-1.005933,-1.407483,81
2022-06-25 00:00:00,-2.810592,-2.869463,-2.086234,-0.830002,98
2022-06-26 00:00:00,-4.846658,-2.089163,-2.873904,0.003005,116
2022-06-27 00:00:00,-4.175247,-2.720846,-3.637249,-0.249034,135
2022-06-28 00:00:00,-5.867168,-3.279988,-4.015531,-0.345414,155

## Histogramming

Frequencies, 'nuff said

```value_counts()```

In [80]:
series1 = pd.Series(np.random.randint(0,5, size = 25))
series1.value_counts()

2    7
4    7
3    4
1    4
0    3
dtype: int64

## String Methods

In [81]:
# build a series
some_string = "SERIes and Index are EqUIppeD WITh A seT Of stRINg PROCESSING METHoDs In tHe ```sTR``` attrIBute THAT MakE IT eASy To oPerATE ON EACh ELEmeNt OF The aRrAY. NOtE thAt PAtTERN-maTching in ```sTR``` gENeralLY UsES reGUlAr eXpreSsiONs bY DEfault (aND In Some cases AlwayS uSEs tHeM)."
str_series = pd.Series(some_string.split()) # split splits on whitespace by default

In [82]:
# manipulating the case - lower, upper etc.
# also the length of each string, split, replace, yada yada...
# very important when cleaning data (column names may have stupid whitespace, bad case, spacing etc.)
low = str_series.str.lower()
up = str_series.str.upper()

low_up_df = pd.DataFrame(
    {
        'og': str_series,
        'length': str_series.str.len(),
        'low': low,
        'up': up,
        'split_low_on_i': low.str.split('i', expand = False), # expand = True will break this usecase, try elsewhere
        'replace_a_with_star_in_low': low.str.replace('a','*', case=False, regex=True) # yeah, you can mess with regular expns
    })

low_up_df.tail(10)

,og,length,low,up,split_low_on_i,replace_a_with_star_in_low
36,eXpreSsiONs,11,expressions,EXPRESSIONS,"[express, ons]",expressions
37,bY,2,by,BY,[by],by
38,DEfault,7,default,DEFAULT,[default],def*ult
39,(aND,4,(and,(AND,[(and],(*nd
40,In,2,in,IN,"[, n]",in
41,Some,4,some,SOME,[some],some
42,cases,5,cases,CASES,[cases],c*ses
43,AlwayS,6,always,ALWAYS,[always],*lw*ys
44,uSEs,4,uses,USES,[uses],uses
45,tHeM).,6,them).,THEM).,[them).],them).

See [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#text-string-methods) for more string operations.

# Merge

Combine series and dataframes, use set logic for indexes and relational algebra for joins/merges

## Concat

Chill, we've done this before. The same join = inner/outer/left/right drill.

In [83]:
# let's make some more dataframes
concatDF = pd.DataFrame(np.random.randn(10,4)) # 10 rows and 4 columns of random numbers
pieces = [concatDF[:3], concatDF[3:7], concatDF[7:]]
reconstructedDF = pd.concat(pieces)
display('broken DFs: ',pieces)
render_df_side_by_side(concatDF, reconstructedDF, "OG", "Concatenated")

'broken DFs: '

[          0         1         2         3
 0 -1.197744  0.819229  0.392096  0.191374
 1 -1.281858  0.991652  1.914914  0.452527
 2  0.351204 -1.030387  0.148986  0.493620,
           0         1         2         3
 3 -0.969490 -0.209932  2.195856 -0.079589
 4  0.018305  1.686774 -1.594840 -1.253074
 5  0.393106 -0.437204 -0.225671  1.173003
 6 -1.987366 -1.744936 -1.436558 -0.591826,
           0         1         2         3
 7 -1.660560 -1.817589  1.332318  1.312493
 8 -1.496923 -1.192164 -0.636744  0.000243
 9  1.515020 -0.020549 -2.104055  1.367774]

,0,1,2,3
0,-1.197744,0.819229,0.392096,0.191374
1,-1.281858,0.991652,1.914914,0.452527
2,0.351204,-1.030387,0.148986,0.493620
3,-0.969490,-0.209932,2.195856,-0.079589
4,0.018305,1.686774,-1.594840,-1.253074
5,0.393106,-0.437204,-0.225671,1.173003
6,-1.987366,-1.744936,-1.436558,-0.591826
7,-1.660560,-1.817589,1.332318,1.312493
8,-1.496923,-1.192164,-0.636744,0.000243
9,1.515020,-0.020549,-2.104055,1.367774
,0,1,2,3
0,-1.197744,0.819229,0.392096,0.191374
1,-1.281858,0.991652,1.914914,0.452527
2,0.351204,-1.030387,0.148986,0.493620
3,-0.969490,-0.209932,2.195856,-0.079589
4,0.018305,1.686774,-1.594840,-1.253074
5,0.393106,-0.437204,-0.225671,1.173003
6,-1.987366,-1.744936,-1.436558,-0.591826
7,-1.660560,-1.817589,1.332318,1.312493
8,-1.496923,-1.192164,-0.636744,0.000243
9,1.515020,-0.020549,-2.104055,1.367774

_From the [page](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html#concat)_:
Adding a column to a DataFrame is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the DataFrame constructor instead of building a DataFrame by iteratively appending records to it.

## Join
SQL style merges.

In [84]:
# two data frames
sl = pd.Series(np.random.randint(10, size=6))
sr = sl.shift(2).fillna(0).astype(int)
left = pd.DataFrame(
    {
        'key': list('ABCDEF'),
        'lval': sl
    }
)

right = pd.DataFrame(
    {
        'key': list('ABBCDE'),
        'rval': sr
    }
)

In [85]:
render_df_side_by_side(left, right, 'left', 'right')

,key,lval
0,A,6
1,B,5
2,C,8
3,D,7
4,E,8
5,F,0
,key,rval
0,A,0
1,B,0
2,B,6
3,C,5
4,D,8
5,E,7

In [86]:
result = pd.merge(left, right, on='key')
result

  key  lval  rval
0   A     6     0
1   B     5     0
2   B     5     6
3   C     8     5
4   D     7     8
5   E     8     7

# Grouping

"Group By" really means one or more of the following happening:
1. **Split**: data is broken into groups based on some criteria
2. **Apply**: a data operation is executed on each of those groups
3. **Combine**: the results are combined back into a data structure

In [87]:
grp_df = pd.DataFrame(
    {
        'colA': list('AABCAABDAA'),
        'colB': list('1234567890'),
        'colC': np.random.randn(10),
        'colD': np.random.randn(10)
    }
)
grp_df

  colA colB      colC      colD
0    A    1 -0.257893  1.156985
1    A    2  0.376632  1.707275
2    B    3  0.575302  0.661318
3    C    4  0.968734  0.128868
4    A    5 -1.685455 -1.027452
5    A    6  0.459046  0.842148
6    B    7  2.438884 -0.790813
7    D    8 -0.622344  0.666964
8    A    9 -0.299112 -0.200319
9    A    0 -3.088109  0.307586

In [88]:
# a DataFrameGroupBy object object
grpby = grp_df.groupby('colA')

# list all the groups found
g = grpby.groups
g

{'A': [0, 1, 4, 5, 8, 9], 'B': [2, 6], 'C': [3], 'D': [7]}

In [89]:
# to create a dataframe from the group use something like
grpby.get_group('A')

  colA colB      colC      colD
0    A    1 -0.257893  1.156985
1    A    2  0.376632  1.707275
4    A    5 -1.685455 -1.027452
5    A    6  0.459046  0.842148
8    A    9 -0.299112 -0.200319
9    A    0 -3.088109  0.307586

### Find all the groups

In [90]:
# but we may not know all the groups in the dataframe.
# so got to find a way to list all groups as dataframes.
# 
# some basic python helps create a list of groupby names
grpby_labels_list = [*g.keys()] # using the unpacking operator *
# alternatively
# grpby_labels_list = list(g.keys())
grpby_labels_list

['A', 'B', 'C', 'D']

In [91]:
# create a dict where the group label is the key and the group dataframe is the value
grps = {lbl: grpby.get_group(lbl) for lbl in grpby_labels_list}

# now use the dict to access individual dataframes created out of the groupby operation
grps['B']

# question: can we create a dataframe of dataframes?

  colA colB      colC      colD
2    B    3  0.575302  0.661318
6    B    7  2.438884 -0.790813

In [92]:
# You can see the datatype of the value is a pandas dataframe
type(grps['A'])

pandas.core.frame.DataFrame

In [93]:
# make a function of it all...
def get_all_groups(df_grpby):
    return {lbl: df_grpby.get_group(lbl) for lbl in [*df_grpby.groups.keys()]}

In [94]:
grps = get_all_groups(grpby)
grps

{'A':   colA colB      colC      colD
 0    A    1 -0.257893  1.156985
 1    A    2  0.376632  1.707275
 4    A    5 -1.685455 -1.027452
 5    A    6  0.459046  0.842148
 8    A    9 -0.299112 -0.200319
 9    A    0 -3.088109  0.307586,
 'B':   colA colB      colC      colD
 2    B    3  0.575302  0.661318
 6    B    7  2.438884 -0.790813,
 'C':   colA colB      colC      colD
 3    C    4  0.968734  0.128868,
 'D':   colA colB      colC      colD
 7    D    8 -0.622344  0.666964}

In [95]:
# get a sum of values from each group
grp_df.groupby('colA').sum()

          colC      colD
colA
A    -4.494891  2.786222
B     3.014185 -0.129495
C     0.968734  0.128868
D    -0.622344  0.666964

In [96]:
# let's add one more column to the dataframe
# we can try grouping on two columns
grp_df['colE'] = list('1231231231')
grp_df

  colA colB      colC      colD colE
0    A    1 -0.257893  1.156985    1
1    A    2  0.376632  1.707275    2
2    B    3  0.575302  0.661318    3
3    C    4  0.968734  0.128868    1
4    A    5 -1.685455 -1.027452    2
5    A    6  0.459046  0.842148    3
6    B    7  2.438884 -0.790813    1
7    D    8 -0.622344  0.666964    2
8    A    9 -0.299112 -0.200319    3
9    A    0 -3.088109  0.307586    1

In [97]:
g2 = grp_df.groupby(['colA','colE'])
grps2 = get_all_groups(g2)
grps2

{('A',
  '1'):   colA colB      colC      colD colE
 0    A    1 -0.257893  1.156985    1
 9    A    0 -3.088109  0.307586    1,
 ('A',
  '2'):   colA colB      colC      colD colE
 1    A    2  0.376632  1.707275    2
 4    A    5 -1.685455 -1.027452    2,
 ('A',
  '3'):   colA colB      colC      colD colE
 5    A    6  0.459046  0.842148    3
 8    A    9 -0.299112 -0.200319    3,
 ('B',
  '1'):   colA colB      colC      colD colE
 6    B    7  2.438884 -0.790813    1,
 ('B',
  '3'):   colA colB      colC      colD colE
 2    B    3  0.575302  0.661318    3,
 ('C',
  '1'):   colA colB      colC      colD colE
 3    C    4  0.968734  0.128868    1,
 ('D',
  '2'):   colA colB      colC      colD colE
 7    D    8 -0.622344  0.666964    2}

In [98]:
render_df_side_by_side(grps2[('A','1')], grps2[('A','2')], 'A,1', 'A,2')

,colA,colB,colC,colD,colE
0,A,1,-0.257893,1.156985,1
9,A,0,-3.088109,0.307586,1
,colA,colB,colC,colD,colE
1,A,2,0.376632,1.707275,2
4,A,5,-1.685455,-1.027452,2

# Reshaping

Stacking and Pivot Tables.
This really warrants more practice, at least go through [the page](https://pandas.pydata.org/pandas-docs/stable/user_guide/reshaping.html#)

## Stacking

In [99]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"],
        ]
    )
)

If the syntax [*expression](https://docs.python.org/dev/reference/expressions.html#calls) appears in the function call, expression must evaluate to an iterable. Elements from these iterables are treated as if they were additional positional arguments.

...although the *expression syntax may appear after explicit keyword arguments, it is processed before the keyword arguments (and any **expression arguments)

In [100]:
# starred expressions...
def f(a,b):
    print(a, ' ', b)
    
f (b=1, *(2,)) # works, the tuple (iterable) is expanded, 2 is assigned to a, then b fills the next argument slot
# f (a=1, *(2,)) # FAILS, multiple values for argument 'a'

2   1

In [101]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [102]:
stack_idx = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])

In [103]:
stack_df = pd.DataFrame(np.random.randn(8,2), index = stack_idx, columns = ['a','b'])
stack_df

                     a         b
first second
bar   one    -0.170065 -0.569963
      two     0.383900 -0.837556
baz   one     0.058849 -0.063302
      two     0.126001 -1.018898
foo   one    -0.458126  0.237337
      two     0.243835  0.491957
qux   one    -0.527230  1.354562
      two     0.395646  0.557078

In [104]:
# stack really just combines the columns
stacked = stack_df.stack()
stacked

first  second
bar    one     a   -0.170065
               b   -0.569963
       two     a    0.383900
               b   -0.837556
baz    one     a    0.058849
               b   -0.063302
       two     a    0.126001
               b   -1.018898
foo    one     a   -0.458126
               b    0.237337
       two     a    0.243835
               b    0.491957
qux    one     a   -0.527230
               b    1.354562
       two     a    0.395646
               b    0.557078
dtype: float64

In [105]:
# unstacked brings back the two columns
# by default unstacks the last level
unstacked = stacked.unstack()
unstacked

                     a         b
first second
bar   one    -0.170065 -0.569963
      two     0.383900 -0.837556
baz   one     0.058849 -0.063302
      two     0.126001 -1.018898
foo   one    -0.458126  0.237337
      two     0.243835  0.491957
qux   one    -0.527230  1.354562
      two     0.395646  0.557078

In [106]:
stacked.unstack(1)

second        one       two
first
bar   a -0.170065  0.383900
      b -0.569963 -0.837556
baz   a  0.058849  0.126001
      b -0.063302 -1.018898
foo   a -0.458126  0.243835
      b  0.237337  0.491957
qux   a -0.527230  0.395646
      b  1.354562  0.557078

In [107]:
stacked.unstack(0)

first          bar       baz       foo       qux
second
one    a -0.170065  0.058849 -0.458126 -0.527230
       b -0.569963 -0.063302  0.237337  1.354562
two    a  0.383900  0.126001  0.243835  0.395646
       b -0.837556 -1.018898  0.491957  0.557078

In [108]:
# you can basically pivot the columns and rows using a combination of stack() and unstack()
unstacked.unstack()

               a                   b
second       one       two       one       two
first
bar    -0.170065  0.383900 -0.569963 -0.837556
baz     0.058849  0.126001 -0.063302 -1.018898
foo    -0.458126  0.243835  0.237337  0.491957
qux    -0.527230  0.395646  1.354562  0.557078

## Pivot Tables

In [109]:
# we're now just using data created in the pandas documentation - just cause, time.
pivot_tables_df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
pivot_tables_df

        A  B    C         D         E
0     one  A  foo  0.667213 -0.418616
1     one  B  foo  1.559843 -0.017348
2     two  C  foo  0.114397  0.861614
3   three  A  bar  0.954509 -0.362555
4     one  B  bar  0.523404 -0.715595
5     one  C  bar -0.393923 -0.174090
6     two  A  foo  1.037512 -1.962240
7   three  B  foo -0.061199  0.616761
8     one  C  foo -0.559858  0.049498
9     one  A  bar  0.396405  0.317031
10    two  B  bar  0.144956 -0.963187
11  three  C  bar  1.498320  0.553560

In [113]:
# simple pivot tables - data, values to aggregate, index, columns to pivot along
pd.pivot_table(pivot_tables_df, values = 'D', index = ['A', 'B'], columns = ['C'])

C             bar       foo
A     B
one   A  0.396405  0.667213
      B  0.523404  1.559843
      C -0.393923 -0.559858
three A  0.954509       NaN
      B       NaN -0.061199
      C  1.498320       NaN
two   A       NaN  1.037512
      B  0.144956       NaN
      C       NaN  0.114397

In [116]:
# more'n one columns of values
# mark all NaN as zero (0)
pd.pivot_table(pivot_tables_df, values = ['D', 'E'], index = ['A', 'B'], columns = ['C']).fillna(0)

                D                   E
C             bar       foo       bar       foo
A     B
one   A  0.396405  0.667213  0.317031 -0.418616
      B  0.523404  1.559843 -0.715595 -0.017348
      C -0.393923 -0.559858 -0.174090  0.049498
three A  0.954509  0.000000 -0.362555  0.000000
      B  0.000000 -0.061199  0.000000  0.616761
      C  1.498320  0.000000  0.553560  0.000000
two   A  0.000000  1.037512  0.000000 -1.962240
      B  0.144956  0.000000 -0.963187  0.000000
      C  0.000000  0.114397  0.000000  0.861614